---
kind: other
id: Properties.T:Autodesk.Revit.DB.FilterStringRule
source: html/f606ed66-c067-9b2f-d4a3-95943698399e.htm
---
# FilterStringRule Properties

Specifies whether the .NET object represents a valid Revit entity.